{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 94], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 94, "activation": {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 94]}}, "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 94]}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Attention", "config": {"name": "attention", "trainable": true, "dtype": "float32", "dropout": 0.0, "use_scale": false, "score_mode": "dot"}, "registered_name": null, "build_config": {"input_shape": [[null, 94], [null, 94]]}, "name": "attention", "inbound_nodes": [[["dense", 0, 0, {}], ["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 94], [null, 94]]}, "name": "multiply", "inbound_nodes": [[["input_1", 0, 0, {}], ["attention", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 94]}, "name": "dense_1", "inbound_nodes": [[["multiply", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Attention", "config": {"name": "attention_1", "trainable": true, "dtype": "float32", "dropout": 0.0, "use_scale": false, "score_mode": "dot"}, "registered_name": null, "build_config": {"input_shape": [[null, 64], [null, 64]]}, "name": "attention_1", "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 64], [null, 64]]}, "name": "multiply_1", "inbound_nodes": [[["dense_1", 0, 0, {}], ["attention_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 32, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_3", "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}, "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Attention", "config": {"name": "attention_2", "trainable": true, "dtype": "float32", "dropout": 0.0, "use_scale": false, "score_mode": "dot"}, "registered_name": null, "build_config": {"input_shape": [[null, 32], [null, 32]]}, "name": "attention_2", "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 32], [null, 32]]}, "name": "multiply_2", "inbound_nodes": [[["dense_3", 0, 0, {}], ["attention_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dropout", "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dense_5", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}